# WireMaterialTypeSet Properties

---
The WireMaterialTypeSet type exposes the following members.
| Name| Description
---|---|---
| IsEmpty| Test to see if the set is empty.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Size| Returns the number of wire material types that are in the set.
Top
#### Reference
WireMaterialTypeSet Class
Autodesk.Revit.DB.Electrical Namespace